jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/Service/impl/AtsStorageServiceImpl.cpp
#include "stm32f1xx_hal.h"
#include "AtsStorageServiceImpl.hpp"
#include "DeviceKey.hpp"
#include "SystemClock.hpp"
#include "MainView.hpp"
#include "ats/ArcanaTsSchema.hpp"
#include "ats/ArcanaTsTypes.hpp"
#include "ff.h"
#include <cstring>
#include <cstdio>

// Synthetic ECG waveform LUT (one heartbeat, 250 samples @ 250Hz = 1 sec = 60 BPM)
// Values 0-99: 0=top of ECG area, 70=baseline, 99=bottom. Like Lead II.
static const uint8_t ECG_LUT[] = {
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,69,68,66,64,63,63,64,66, 68,69,70,70,70,70,70,70,70,70, // P wave (small)
    70,70,70,70,70,70,70,70,72,75, 70,50,25, 5, 0, 5,25,50,80,90, // Q-R-S (sharp!)
    85,78,72,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // ST segment
    70,69,67,64,61,58,56,55,55,56, 58,61,64,67,69,70,70,70,70,70, // T wave (rounded)
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70, // baseline
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70, 70,70,70,70,70,70,70,70,70,70,
    70,70,70,70,70,70,70,70,70,70,
};
static const uint16_t ECG_LUT_LEN = sizeof(ECG_LUT);


extern "C" {
    extern volatile uint8_t g_exfat_ready;
    void sdio_force_reinit(void);
}

namespace arcana {

// Defined in Controller.cpp
extern lcd::MainView* g_mainView;
namespace atsstorage {

// Static storage
uint8_t AtsStorageServiceImpl::sKey[crypto::ChaCha20::KEY_SIZE] = {};
uint8_t AtsStorageServiceImpl::sSlowBuf[ats::BLOCK_SIZE] = {};
uint8_t AtsStorageServiceImpl::sReadCache[ats::BLOCK_SIZE] = {};
uint8_t AtsStorageServiceImpl::sDevSlowBuf[ats::BLOCK_SIZE] = {};

// Time source for ArcanaTS — uses SystemClock epoch or tick fallback
static uint32_t atsGetTime() {
    if (SystemClock::getInstance().isSynced()) {
        return SystemClock::getInstance().now();
    }
    return (uint32_t)xTaskGetTickCount();
}

AtsStorageServiceImpl::AtsStorageServiceImpl()
    : mDb()
    , mFilePort()
    , mMutex()
    , mCipher()
    , mTaskBuffer()
    , mTaskStack{}
    , mTaskHandle(0)
    , mRunning(false)
    , mDbReady(false)
    , mDeviceDbReady(false)
    , mPendingData()
    , mWriteSemBuffer()
    , mWriteSem(0)
    , mStatsObs("AtsStorage Stats")
    , mStatsModel()
    , mTotalRecords(0)
    , mWindowStartTick(0)
    , mWritesInWindow(0)
    , mLastRate(0)
    , mBaselineBlocksFailed(0)
{
    input.SensorData = 0;
    output.StatsEvents = &mStatsObs;
}

AtsStorageServiceImpl::~AtsStorageServiceImpl() {
    stop();
}

AtsStorageService& AtsStorageServiceImpl::getInstance() {
    static AtsStorageServiceImpl sInstance;
    return sInstance;
}

ServiceStatus AtsStorageServiceImpl::initHAL() {
    crypto::DeviceKey::deriveKey(sKey);
    return ServiceStatus::OK;
}

ServiceStatus AtsStorageServiceImpl::init() {
    mWriteSem = xSemaphoreCreateBinaryStatic(&mWriteSemBuffer);
    if (!mWriteSem) return ServiceStatus::Error;

    mMutex.init();

    return ServiceStatus::OK;
}

ServiceStatus AtsStorageServiceImpl::start() {
    mRunning = true;
    mTaskHandle = xTaskCreateStatic(
        storageTask, "AtsStore", TASK_STACK_SIZE,
        this, tskIDLE_PRIORITY + 1, mTaskStack, &mTaskBuffer);
    if (!mTaskHandle) return ServiceStatus::Error;

    if (input.SensorData) {
        input.SensorData->subscribe(onSensorData, this);
    }
    return ServiceStatus::OK;
}

void AtsStorageServiceImpl::stop() {
    mRunning = false;
    if (mTaskHandle) {
        xSemaphoreGive(mWriteSem);
        vTaskDelay(pdMS_TO_TICKS(50));
        mTaskHandle = 0;
    }
    if (mDbReady) {
        mDb.close();
        mDbReady = false;
    }
    if (mDeviceDbReady) {
        writeLifecycleEvent(
            static_cast<uint8_t>(ats::LifecycleEventType::PowerOff), 0);
        mDeviceDb.close();
        mDeviceDbReady = false;
    }
}

void AtsStorageServiceImpl::onSensorData(SensorDataModel* model, void* context) {
    AtsStorageServiceImpl* self = static_cast<AtsStorageServiceImpl*>(context);
    self->mPendingData = *model;
    xSemaphoreGive(self->mWriteSem);
}

void AtsStorageServiceImpl::storageTask(void* param) {
    AtsStorageServiceImpl* self = static_cast<AtsStorageServiceImpl*>(param);

    // Wait for exFAT filesystem
    while (!g_exfat_ready && self->mRunning) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    if (!self->mRunning) { vTaskDelete(0); return; }

    // Clean up corrupt files from previous crashes
    f_unlink("sensor_bad.ats");

    // Proactive SDIO reinit — ensures stable reads during DB recovery
    sdio_force_reinit();
    printf("[ATS] SD cleanup + SDIO reinit done\r\n");

    // Open device.ats (permanent lifecycle DB) + restore RTC
    if (self->openDeviceDb()) {
        self->restoreTimeFromDeviceDb();
        self->writeLifecycleEvent(
            static_cast<uint8_t>(ats::LifecycleEventType::PowerOn), 0);
    }

    printf("[ATS] Opening sensor DB...\r\n");
    if (!self->openDailyDb()) {
        printf("[ATS] Open FAILED\r\n");
        // Publish zero stats so LCD shows "0" instead of blank
        self->mStatsModel.recordCount = 0;
        self->mStatsModel.writesPerSec = 0;
        self->mStatsModel.totalKB = 0;
        self->mStatsModel.kbPerSec = 0;
        self->mStatsModel.updateTimestamp();
        self->mStatsObs.publish(&self->mStatsModel);
        vTaskDelete(0);
        return;
    }

    // Write test: verify the DB is actually writable (catches corrupted files)
    {
        uint8_t testRec[RECORD_SIZE] = {};
        uint32_t ts = atsGetTime();
        memcpy(testRec, &ts, 4);
        self->mDb.append(0, testRec);
        uint32_t blkBefore = self->mDb.getStats().blocksWritten;
        self->mDb.flush();
        uint32_t blkAfter = self->mDb.getStats().blocksWritten;
        if (blkAfter <= blkBefore) {
            // Flush failed — may be stale SDIO state from debugger reset
            // Try SDIO reinit + retry before giving up
            printf("[ATS] Write test FAILED, SDIO reinit + retry...\r\n");
            sdio_force_reinit();
            self->mDb.append(0, testRec);
            blkBefore = self->mDb.getStats().blocksWritten;
            self->mDb.flush();
            blkAfter = self->mDb.getStats().blocksWritten;
        }
        if (blkAfter <= blkBefore) {
            // Still failed after reinit — truly corrupted, rename and recreate
            printf("[ATS] Write test FAILED after reinit, renaming...\r\n");
            self->mDb.close();
            self->mDbReady = false;
            f_rename("sensor.ats", "sensor_bad.ats");
            sdio_force_reinit();
            printf("[ATS] Recreating...\r\n");
            if (!self->openDailyDb()) {
                printf("[ATS] Recreate FAILED\r\n");
                self->mStatsModel.recordCount = 0;
                self->mStatsModel.writesPerSec = 0;
                self->mStatsModel.totalKB = 0;
                self->mStatsModel.kbPerSec = 0;
                self->mStatsModel.updateTimestamp();
                self->mStatsObs.publish(&self->mStatsModel);
                vTaskDelete(0);
                return;
            }
            printf("[ATS] Fresh DB created\r\n");
        } else {
            printf("[ATS] Write test OK\r\n");
        }
    }

    // Log recovery event to both device.ats and sensor.ats
    {
        const ats::StorageStats& st = self->mDb.getStats();
        self->writeRecoveryEvents(
            st.totalRecords,
            (uint16_t)st.recoveryTruncations,
            (uint16_t)(st.blocksFailed - self->mBaselineBlocksFailed));
    }

    // Publish initial stats immediately so LCD shows recovered state
    // (don't wait 1 second for first taskLoop report)
    self->mStatsModel.recordCount = self->mTotalRecords;
    self->mStatsModel.writesPerSec = 0;
    self->mStatsModel.totalKB = (self->mDb.getStats().blocksWritten + 1) * 4;
    self->mStatsModel.kbPerSec = 0;
    self->mStatsModel.updateTimestamp();
    self->mStatsObs.publish(&self->mStatsModel);

    printf("[ATS] Ready, 1kHz mode\r\n");
    self->taskLoop();
    vTaskDelete(0);
}

