jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/Service/impl/AtsStorageServiceImpl.cpp
    // LIFECYCLE schema: ts(U32), evtTyp(U8), evtCod(U16), rsv(U8), param(U32) = 12 bytes
    uint8_t rec[12];
    uint32_t ts = atsGetTime();
    memcpy(rec, &ts, 4);
    rec[4] = eventType;
    rec[5] = 0; rec[6] = 0;  // eventCode = 0
    rec[7] = 0;               // reserved
    memcpy(rec + 8, &param, 4);

    mDeviceDb.append(0, rec);
    mDeviceDb.flush();  // lifecycle events must persist immediately
    printf("[DEV] event type=0x%02X param=%lu\r\n",
           (unsigned)eventType, (unsigned long)param);
}

void AtsStorageServiceImpl::writeRecoveryEvents(
        uint32_t recoveredRec, uint16_t truncations, uint16_t skippedBlocks) {
    // 1. device.ats — LIFECYCLE Recovery event
    //    evtTyp=Recovery, evtCod=truncations, param=recoveredRec
    if (mDeviceDbReady) {
        uint8_t rec[12];
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        rec[4] = static_cast<uint8_t>(ats::LifecycleEventType::Recovery);
        uint16_t code = truncations;
        memcpy(rec + 5, &code, 2);
        rec[7] = (uint8_t)skippedBlocks;
        memcpy(rec + 8, &recoveredRec, 4);
        mDeviceDb.append(0, rec);
        mDeviceDb.flush();
        printf("[DEV] Recovery: %lu rec, trunc=%u, skip=%u\r\n",
               (unsigned long)recoveredRec, (unsigned)truncations,
               (unsigned)skippedBlocks);
    }

    // 2. sensor.ats — ERROR_LOG ch1 (if channel exists)
    //    sev=INFO(1), src=ATS(0x10), errCod=truncations, param=recoveredRec
    if (mDbReady && mDb.getChannelCount() > 1) {
        uint8_t rec[12];
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        rec[4] = 0x01;   // severity: INFO
        rec[5] = 0x10;   // source: ATS recovery
        uint16_t code = truncations;
        memcpy(rec + 6, &code, 2);
        memcpy(rec + 8, &recoveredRec, 4);
        mDb.append(1, rec);
        // flush happens in taskLoop's first 1-second window
    }
}

// ---------------------------------------------------------------------------

void AtsStorageServiceImpl::taskLoop() {
    uint32_t lastDay = 0;
    uint32_t lastReportTick = xTaskGetTickCount();
    TickType_t nextWake = xTaskGetTickCount();
    uint32_t windowOk = 0;
    uint32_t windowFail = 0;
    uint8_t rec[RECORD_SIZE];
    memset(rec, 0, RECORD_SIZE);
    uint32_t ecgPhase = 0;  // LUT index for synthetic ECG

    while (mRunning) {
        // 1kHz pacing — 1 record per ms
        vTaskDelayUntil(&nextWake, 1);

        if (!mDbReady) {
            // DB failed (e.g. rotation error) — retry every 5 seconds
            static uint32_t retryTick = 0;
            uint32_t now = xTaskGetTickCount();
            if (now - retryTick >= pdMS_TO_TICKS(5000)) {
                retryTick = now;
                printf("[ATS] DB not ready, retrying open...\r\n");
                sdio_force_reinit();
                if (openDailyDb()) {
                    printf("[ATS] DB recovered!\r\n");
                } else {
                    printf("[ATS] DB retry FAILED\r\n");
                }
            }
            continue;
        }

        // Synthetic ECG value from LUT
        uint8_t ecgVal = ECG_LUT[ecgPhase % ECG_LUT_LEN];
        ecgPhase++;

        // Push ECG sample to View via queue (250Hz, thread-safe)
        if ((mTotalRecords & 3) == 0 && g_mainView) {
            g_mainView->pushEcgSample(ecgVal);
        }

        // Build synthetic record (will be replaced by real ADS1298 SPI data)
        uint32_t ts = atsGetTime();
        memcpy(rec, &ts, 4);
        float temp = 25.0f + (float)(mTotalRecords % 1000) * 0.01f;
        memcpy(rec + 4, &temp, 4);
        int16_t ax = (int16_t)(50 - (int16_t)ecgVal) * 400;  // ECG as accelerometer value
        memcpy(rec + 8, &ax, 2);
        memcpy(rec + 10, &ax, 2);
        memcpy(rec + 12, &ax, 2);

        if (mDb.append(0, rec)) {
            mTotalRecords++;
            windowOk++;
        } else {
            windowFail++;
        }

        // Report + LCD update every 1 second
        uint32_t now = xTaskGetTickCount();
        if ((now - lastReportTick) >= pdMS_TO_TICKS(1000)) {
            bool flushed = mDb.flush();
            if (!flushed) {
                sdio_force_reinit();
                flushed = mDb.flush();
                if (!flushed) printf("[ATS] flush FAILED (after reinit)\r\n");
            }

            mStatsModel.recordCount = mTotalRecords;
            mStatsModel.writesPerSec = (uint16_t)windowOk;
            mStatsModel.totalKB = (mDb.getStats().blocksWritten + 1) * 4;
            mStatsModel.kbPerSec = (uint16_t)(windowOk * RECORD_SIZE / 1024);
            mStatsModel.updateTimestamp();
            mStatsObs.publish(&mStatsModel);

            uint32_t sessionFail = mDb.getStats().blocksFailed - mBaselineBlocksFailed;
            printf("[ATS] %lu rec, %lu/s, blk=%lu (%luKB) fail=%lu drop=%lu\r\n",
                   (unsigned long)mTotalRecords, (unsigned long)windowOk,
                   (unsigned long)mDb.getStats().blocksWritten,
                   (unsigned long)mStatsModel.totalKB,
                   (unsigned long)sessionFail,
                   (unsigned long)mDb.getStats().overflowDrops);

            windowOk = 0;
            windowFail = 0;
            lastReportTick = now;

            // Midnight rotation
            if (SystemClock::getInstance().isSynced()) {
                uint32_t today = SystemClock::dateYYYYMMDD(
                    SystemClock::getInstance().now());
                if (lastDay != 0 && today != lastDay) {
                    rotateDailyDb(lastDay);
                }
                lastDay = today;
            }
        }
    }
}

void AtsStorageServiceImpl::appendRecord(const SensorDataModel* model) {
    if (!mDbReady) return;

    uint8_t rec[RECORD_SIZE];
    serializeRecord(model, rec);

    if (mDb.append(0, rec)) {
        mTotalRecords++;
        mWritesInWindow++;

        // Rate tracking (DWT cycle counter, 1-second window)
        static volatile uint32_t* const DWT_CYCCNT = (volatile uint32_t*)0xE0001004;
        uint32_t now = *DWT_CYCCNT;
        if (mWindowStartTick == 0) {
            mWindowStartTick = now;
        }
        uint32_t elapsed = now - mWindowStartTick;
        uint32_t elapsedMs = elapsed / (SystemCoreClock / 1000);
        if (elapsedMs >= 1000) {
            mLastRate = mWritesInWindow;
            printf("[ATS] %lu rec, %u rec/s, blk=%lu\r\n",
                   (unsigned long)mTotalRecords,
                   (unsigned)mLastRate,
                   (unsigned long)mDb.getStats().blocksWritten);
            mWritesInWindow = 0;
            mWindowStartTick = now;
        }

        mStatsModel.recordCount = mTotalRecords;
        mStatsModel.writesPerSec = mLastRate;
        mStatsModel.totalKB = (mDb.getStats().blocksWritten + 1) * 4;
        mStatsModel.kbPerSec = (uint16_t)(mLastRate * RECORD_SIZE / 1024);
        mStatsModel.updateTimestamp();
        mStatsObs.publish(&mStatsModel);
    }
}

void AtsStorageServiceImpl::serializeRecord(const SensorDataModel* model, uint8_t* buf) {
    // ts: U32 (epoch seconds)
    uint32_t ts = atsGetTime();
    memcpy(buf, &ts, 4);

    // temp: F32
    memcpy(buf + 4, &model->temperature, 4);

